## 5 - Updating Rows and Colulmns, modifying Data Within DataFrames

In [1]:
people = {
    "first": ["Corey", "Jane", "Jhon"],
    "last": ["Schafer", "Doe", "Doe"],
    "email": ["CoreyMSchager@gmail.com", "loco@gamil.com", "lineal@gmail.com"],
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchager@gmail.com
1   Jane      Doe           loco@gamil.com
2   Jhon      Doe         lineal@gmail.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = ['First_Name','Last_Name','email']
df

  First_Name Last_Name                    email
0      Corey   Schafer  CoreyMSchager@gmail.com
1       Jane       Doe           loco@gamil.com
2       Jhon       Doe         lineal@gmail.com

In [7]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchager@gmail.com
1       Jane       Doe           loco@gamil.com
2       Jhon       Doe         lineal@gmail.com

In [8]:
df.columns = df.columns.str.replace('_',' ')
df

  first name last name                    email
0      Corey   Schafer  CoreyMSchager@gmail.com
1       Jane       Doe           loco@gamil.com
2       Jhon       Doe         lineal@gmail.com

In [9]:
df.rename(columns={'first name':'first', 'last name': 'last'}, inplace=True)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchager@gmail.com
1   Jane      Doe           loco@gamil.com
2   Jhon      Doe         lineal@gmail.com

In [11]:
df.loc[2] = ['Imanol','Aguer','imanolaguer1@gmail.com']
df

    first     last                    email
0   Corey  Schafer  CoreyMSchager@gmail.com
1    Jane      Doe           loco@gamil.com
2  Imanol    Aguer   imanolaguer1@gmail.com

In [12]:
df.loc[2, ['first','email']] = ['Pnachito','pnachito@gmail.com']
df

      first     last                    email
0     Corey  Schafer  CoreyMSchager@gmail.com
1      Jane      Doe           loco@gamil.com
2  Pnachito    Aguer       pnachito@gmail.com

In [17]:
filt = (df['email'] == 'pnachito@gmail.com')
df[filt]['last'] = 'Smith'

C:\Users\User\AppData\Local\Temp\ipykernel_15048\2585784616.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last'] = 'Smith'

In [18]:
df

      first     last                    email
0     Corey  Schafer  CoreyMSchager@gmail.com
1      Jane      Doe           loco@gamil.com
2  Pnachito    Aguer       pnachito@gmail.com

In [19]:
df.loc[filt, 'last'] = ['Smith']
df

      first     last                    email
0     Corey  Schafer  CoreyMSchager@gmail.com
1      Jane      Doe           loco@gamil.com
2  Pnachito    Smith       pnachito@gmail.com

In [20]:
df['email'] = df['email'].str.lower()
df

      first     last                    email
0     Corey  Schafer  coreymschager@gmail.com
1      Jane      Doe           loco@gamil.com
2  Pnachito    Smith       pnachito@gmail.com

In [21]:
# apply method

In [23]:
df['email'].apply(len)

0    23
1    14
2    18
Name: email, dtype: int64

In [24]:
def update_email(email):
    return email.upper()

In [26]:
df['email'] = df['email'].apply(update_email)
df

      first     last                    email
0     Corey  Schafer  COREYMSCHAGER@GMAIL.COM
1      Jane      Doe           LOCO@GAMIL.COM
2  Pnachito    Smith       PNACHITO@GMAIL.COM

In [27]:
df['email'] = df['email'].apply(lambda x: x.lower())
df

      first     last                    email
0     Corey  Schafer  coreymschager@gmail.com
1      Jane      Doe           loco@gamil.com
2  Pnachito    Smith       pnachito@gmail.com

In [28]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [29]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschager@gmail.com
dtype: object

In [32]:
# applymap method

In [33]:
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     14
2      8     5     18

In [34]:
df.applymap(str.upper)

      first     last                    email
0     COREY  SCHAFER  COREYMSCHAGER@GMAIL.COM
1      JANE      DOE           LOCO@GAMIL.COM
2  PNACHITO    SMITH       PNACHITO@GMAIL.COM

In [35]:
df

      first     last                    email
0     Corey  Schafer  coreymschager@gmail.com
1      Jane      Doe           loco@gamil.com
2  Pnachito    Smith       pnachito@gmail.com

In [36]:
### map method

In [39]:
df['first'].map({'Corey':'Lionel', 'Jane':'Cristiano'})

0       Lionel
1    Cristiano
2          NaN
Name: first, dtype: object

In [40]:
df['first'] = df['first'].map({'Corey':'Lionel', 'Jane':'Cristiano'})
df

       first     last                    email
0     Lionel  Schafer  coreymschager@gmail.com
1  Cristiano      Doe           loco@gamil.com
2        NaN    Smith       pnachito@gmail.com

## Working with Stackoverflow Data

In [41]:
dfs = pd.read_csv('../data/survey_results_public.csv')
schema_dfs = pd.read_csv('../data/survey_results_schema.csv')

In [42]:
dfs.head(3)

,ResponseId,MainBranch,Employment,RemoteWork,CodingActivities,EdLevel,LearnCode,LearnCodeOnline,LearnCodeCoursesCert,YearsCode,...,TimeSearching,TimeAnswering,Onboarding,ProfessionalTech,TrueFalse_1,TrueFalse_2,TrueFalse_3,SurveyLength,SurveyEase,ConvertedCompYearly
0,1,None of these,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,I am a developer by profession,"Employed, full-time",Fully remote,Hobby;Contribute to open-source projects,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Too long,Difficult,NaN
2,3,"I am not primarily a developer, but I write co...","Employed, full-time","Hybrid (some remote, some in-person)",Hobby,"Master’s degree (M.A., M.S., M.Eng., MBA, etc.)",Books / Physical media;Friend or family member...,Technical documentation;Blogs;Programming Game...,NaN,14,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Neither easy nor difficult,40205.0

In [43]:
dfs['Currency']

0                              NaN
1             CAD\tCanadian dollar
2              GBP\tPound sterling
3          ILS\tIsraeli new shekel
4        USD\tUnited States dollar
                   ...
73263    USD\tUnited States dollar
73264    USD\tUnited States dollar
73265    USD\tUnited States dollar
73266          GBP\tPound sterling
73267                          NaN
Name: Currency, Length: 73268, dtype: object

In [47]:
dfs.rename(columns={'Currency':'LocalCurrency'}, inplace=True)

In [48]:
dfs['LocalCurrency']

0                              NaN
1             CAD\tCanadian dollar
2              GBP\tPound sterling
3          ILS\tIsraeli new shekel
4        USD\tUnited States dollar
                   ...
73263    USD\tUnited States dollar
73264    USD\tUnited States dollar
73265    USD\tUnited States dollar
73266          GBP\tPound sterling
73267                          NaN
Name: LocalCurrency, Length: 73268, dtype: object

In [49]:
dfs['SurveyEase']

0                               NaN
1                         Difficult
2        Neither easy nor difficult
3                              Easy
4                              Easy
                    ...
73263                          Easy
73264                          Easy
73265                          Easy
73266                          Easy
73267                          Easy
Name: SurveyEase, Length: 73268, dtype: object

In [50]:
dfs['SurveyEase'] = dfs['SurveyEase'].map({'Easy':'Facil','Difficult':'Dificil','Neither easy nor difficult':'Quep edo pytpo'})
dfs['SurveyEase']

0                   NaN
1               Dificil
2        Quep edo pytpo
3                 Facil
4                 Facil
              ...
73263             Facil
73264             Facil
73265             Facil
73266             Facil
73267             Facil
Name: SurveyEase, Length: 73268, dtype: object

In [51]:
dfs.head()

,ResponseId,MainBranch,Employment,RemoteWork,CodingActivities,EdLevel,LearnCode,LearnCodeOnline,LearnCodeCoursesCert,YearsCode,...,TimeSearching,TimeAnswering,Onboarding,ProfessionalTech,TrueFalse_1,TrueFalse_2,TrueFalse_3,SurveyLength,SurveyEase,ConvertedCompYearly
0,1,None of these,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,I am a developer by profession,"Employed, full-time",Fully remote,Hobby;Contribute to open-source projects,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Too long,Dificil,NaN
2,3,"I am not primarily a developer, but I write co...","Employed, full-time","Hybrid (some remote, some in-person)",Hobby,"Master’s degree (M.A., M.S., M.Eng., MBA, etc.)",Books / Physical media;Friend or family member...,Technical documentation;Blogs;Programming Game...,NaN,14,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Quep edo pytpo,40205.0
3,4,I am a developer by profession,"Employed, full-time",Fully remote,I don’t code outside of work,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)","Books / Physical media;School (i.e., Universit...",NaN,NaN,20,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Facil,215232.0
4,5,I am a developer by profession,"Employed, full-time","Hybrid (some remote, some in-person)",Hobby,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)","Other online resources (e.g., videos, blogs, f...",Technical documentation;Blogs;Stack Overflow;O...,NaN,8,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Too long,Facil,NaN

# parte 6: Add or Remove Rows and Columns From DataFrame

In [54]:
df

       first     last                    email
0     Lionel  Schafer  coreymschager@gmail.com
1  Cristiano      Doe           loco@gamil.com
2        NaN    Smith       pnachito@gmail.com

In [52]:
df['first']+ " " +df['last']

0    Lionel Schafer
1     Cristiano Doe
2               NaN
dtype: object

In [55]:
df['Full_Name'] = df['first']+ " " +df['last']
df

       first     last                    email       Full_Name
0     Lionel  Schafer  coreymschager@gmail.com  Lionel Schafer
1  Cristiano      Doe           loco@gamil.com   Cristiano Doe
2        NaN    Smith       pnachito@gmail.com             NaN

In [56]:
df.drop(columns=['first', 'last'], inplace=True)

In [57]:
df

                     email       Full_Name
0  coreymschager@gmail.com  Lionel Schafer
1           loco@gamil.com   Cristiano Doe
2       pnachito@gmail.com             NaN

In [58]:
df['Full_Name'].str.split(" ", expand=True)

           0        1
0     Lionel  Schafer
1  Cristiano      Doe
2        NaN      NaN

In [59]:
df[['first','last']] = df['Full_Name'].str.split(" ", expand=True)
df

                     email       Full_Name      first     last
0  coreymschager@gmail.com  Lionel Schafer     Lionel  Schafer
1           loco@gamil.com   Cristiano Doe  Cristiano      Doe
2       pnachito@gmail.com             NaN        NaN      NaN

In [61]:
df.drop(columns=['Full_Name'], inplace=True)
df

                     email      first     last
0  coreymschager@gmail.com     Lionel  Schafer
1           loco@gamil.com  Cristiano      Doe
2       pnachito@gmail.com        NaN      NaN

In [62]:
df = pd.concat([df, pd.DataFrame([{'first': 'Tonyloco'}])])
df

                     email      first     last
0  coreymschager@gmail.com     Lionel  Schafer
1           loco@gamil.com  Cristiano      Doe
2       pnachito@gmail.com        NaN      NaN
0                      NaN   Tonyloco      NaN

In [63]:
people2 = {
    "first": ["George", "Martin"],
    "last": ["Hotz", "Shkreli"],
    "email": ["Hotz@gmail.com", "Shkreli@gamil.com"],
}

In [64]:
df2 = pd.DataFrame(people2)
df2

    first     last              email
0  George     Hotz     Hotz@gmail.com
1  Martin  Shkreli  Shkreli@gamil.com

In [73]:
df = pd.concat([df,df2], ignore_index=True, sort=False)
df

                     email      first     last
0  coreymschager@gmail.com     Lionel  Schafer
1           loco@gamil.com  Cristiano      Doe
2       pnachito@gmail.com        NaN      NaN
3                      NaN   Tonyloco      NaN
4           Hotz@gmail.com     George     Hotz
5        Shkreli@gamil.com     Martin  Shkreli

In [72]:
df.drop(index={4,5,6,7,8,9}, inplace=True)

In [74]:
df.drop(index=(3), inplace=True)
df

                     email      first     last
0  coreymschager@gmail.com     Lionel  Schafer
1           loco@gamil.com  Cristiano      Doe
2       pnachito@gmail.com        NaN      NaN
4           Hotz@gmail.com     George     Hotz
5        Shkreli@gamil.com     Martin  Shkreli

In [75]:
df.drop(index=[4,5], inplace=True)
df

                     email      first     last
0  coreymschager@gmail.com     Lionel  Schafer
1           loco@gamil.com  Cristiano      Doe
2       pnachito@gmail.com        NaN      NaN

In [76]:
df.drop(index=df[df['last'] == 'Doe'].index, inplace=True)
df

                     email   first     last
0  coreymschager@gmail.com  Lionel  Schafer
2       pnachito@gmail.com     NaN      NaN